# СТЕКД + С = ВЫДЕЛЯЕТ
# СТЕКД + / = КОММЕНТ
# CTRL + v = ВСТАВИТЬ
# CTRL + Z = ВОЗВРАЩАТЬ  ОБРАТНО
# CTRL + SHRIFT + Z =  воЗВРАЩВЕТ КОД НА ШАГ ВПЕРЕД
# CTRL + D =  КОПИРОВАТЬ И ВСТАВИТЬ
# CTRL + X = ВЫРЕЗАЕТ
#  CTRL + A = ВЫДЕЛЯЕТ ВЕСЬ КОД
# CTRL + ALT + l = ВЫДЕЛЯЕТ КОД
#
# ALT  + MOUSE = ВВОДИТ ТЕКСТ В НУЖНЫХ ВАМ МЕСТАХ
# ALT + TAB = ПЕРЕМЕЩЕНИЕ ПО ПРИЛОЖЕНИЯМ
# SHRIFT + ALT = ПЕРЕВОД КЛАВИАТУРЫ
# CTRL + D = repeating the line
# ctrl + / = текст переносит в коммент


# lesson 1 :
# встроенные функции- type , print
# переменные- изменяющееся слова где можно хранить данные
# как можно создавать переменные
# var_1= ok
# varOne= ok
# Var= ok
# комментарии- это заметки для читающего можно чтото  поправить
#
# методы строк это после переменных точка:
# lower title(пишет заглавной буквой в ковычках)
#
# типы даннных
# целые    дробные числа     строки
#                             если в ''то строка


# set tип данных хранятся не повторяются не изменяется удалить добавить

                    арифметические операторы
print(5 + 2)
print(5 - 2)
print(5 * 2)
print(5 / 2)
print(10 // 2)
print(5 ** 2)
print(5 % 2)
псаи
аргс для множества аргументов
списки завернуты в квадратных скобках
 методы:  append-
numbers = [21, 34, 54, 12]

print("Before Append:", numbers)

# Использование метода append()
numbers.append(32)

print("After Append:", numbers)
extend
кортежи в круглых скобках
словари в фигурных скобках
списки в квдратных скобках


